[
  {
    "file": "16401_MDRZW026-sEAP.pdf",
    "document_id": 16401,
    "document_name": "Zimbabwe - Cholera sEAP (MDRZW026)",
    "document_language": "English",
    "status": "success",
    "pages_analyzed": 25,
    "pages_selected": 9,
    "trigger_mechanism": {
      "description": "The sEAP utilizes a staged intervention approach with three consecutive phases of action, each activated by a specific trigger related to the location and severity of cholera cases.",
      "activation_type": "multi-stage",
      "has_stop_mechanism": true,
      "stop_mechanism_description": "The sEAP does not have a traditional stop mechanism but employs a 'scale down mechanism' at each phase. Activities can be tapered off or sustained without proceeding to the next phase if outbreaks are contained or do not spread beyond their initial geographic location."
    },
    "triggers": {
      "trigger_statement_1": {
        "statement": "The sEAP adopts a staged intervention which uses separate triggers to initiate three consecutive phases of action. Phase 1: A confirmed cholera case in any district of the country. Phase 2: A case confirmed in Harare. Phase 3: Evidence of community transmission in Harare and spread to additional districts.",
        "statement_english": null,
        "thresholds": [
          "A confirmed cholera case (Vibrio Cholerae 01 or 0139 by culture or PCR) in any district of the country",
          "A confirmed cholera case in Harare",
          "Evidence of community transmission in Harare",
          "Spread of cholera to additional districts",
          "Thresholds generated by local clinics to determine necessity of ORP deployments"
        ],
        "source_authority": "Ministry of Health and Child Care (MoHCC)",
        "lead_time": "Within days of the receipt of an alert",
        "geographic_scope": "Zimbabwe (National), with specific focus on Harare urban hotspots and vulnerable rural districts",
        "is_conditional": true,
        "condition_dependency": "Phases are consecutive; Phase 2 follows Phase 1, and Phase 3 follows Phase 2 based on the escalation of the outbreak.",
        "preliminary_actions": "Phase 1: Deployment of mobile Surge Team to affected districts; BORT teams in Harare for messaging and targeting surveys (FCR tests). Phase 2: RRT investigations in target areas; BORT deployment with NFIs; distribution of inline chlorinator tablets; development of DREF document for needs outside Harare.",
        "page_ref": 13
      }
    },
    "notes": []
  }
]